/* 
 * 작성 일자 : 2023 2 27 오후 1 18
 * 작성자 : 함경환
 * 작성내용 : 기본 정수형을 이용한 사칙연산 실습
 */

// 기본 정수형을 이용한 사칙연산 연습
public class EX01
{
	public static void main(String[] args)
	{
		// 사용할 변수를 선언하고, 0으로 초기화 한다 ==============================================
		int x = 0;
		int y = 0;
		double z = 0;
		float i = 2;
		System.out.println("i : " + i);
		char c = 'a';
		// =============================================================================
		
		// 변수에 값을 할당하고, 사칙연산을 한다 =================================================
		x = 20;
		y = 3; 
		z = x / (double)y;
		i = x % y;
		// =============================================================================
		
		// 콘솔에 연산 결과를 출력한다 ========================================================= 
		System.out.println("몫 = " + z);
		System.out.println("나머지 = " + i);
		// 콘솔에 연산 결과를 출력한다 ========================================================= 
	}
}